INSERT INTO patients (first_name, last_name, birth_date, phone)
VALUES
    ('Кронас', 'Бандит', '2021-01-01', '8-800-255-35-35'),
    ('Борис', 'Меньшиков', '1890-10-15','8-800-200-08-90'),
    ('Биба', 'Егоров', '1998-09-09','8-526-427-07-95'),
    ('Иван', 'Русский', '1780-02-02','8-090-833-12-12'),
    ('Путин', 'Гербов', '1978-02-20','8-000-000-01-01');


SELECT *
FROM patients
WHERE id NOT IN (SELECT MIN(id)
                            FROM patients
                 GROUP BY first_name, last_name, birth_date, phone);


INSERT INTO doctors (first_name, last_name, specialty)
VALUES ('Бондарь', 'Позалини', 'Спинолог'),
       ('Егор', 'Довлатов', 'Носолог'),
       ('Армен', 'Иванов', 'Стоматолог'),
       ('Боня', 'Клойдовна', 'Мозголог'),
       ('Екатерина', 'Тихонова', 'Ортопед');



INSERT INTO appointments (doctor_id, patient_id, diagnosis, appointment_date)
VALUES (1,6,'Спинная болезнь','2025-06-24 12:12'),
       (2,4,'Слишком большой носище','2025-06-24 10:15'),
       (3,5,'Нет зубов','2025-06-24 09:00'),
       (4,1,'Безмозглый','2025-06-24 08:00'),
       (5,3,'Острая безногость','2025-06-24 15:12');